app/views/articles/index.html.erb

			<div class="shape bubble">
				<p><%= article.comments.count%></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 13]]