app/views/articles/show.html.erb


			<% if !@article.comments.empty?%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 13]]