app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Newsa"], ["body", "asdadasaaa"], ["updated_at", "2016-01-19 12:07:01.410794"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)